[

][

][

][

][

][
{"company-title-link": "https://www.ghanajob.com/recruiter/125681", "company-title": "AFRICASHORE", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/imgpsh_fullsize_anim_1.png?itok=qhzbb8GO", "company-website-label": "Website : ", "company-website-url": "https://www.africashore.com/", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet", "Temporary work, recruitment"], "job-title": "Position : Team Leader/Team Manager for NOC Support - Remote Freelance Job", "job-description": "We are looking for 5 Team Leaders/Team Managers For NOC Support to work remotely as Freelancers for our client, an international software company. The Technical Back Office is responsible for providing advanced technical support, monitoring network infrastructure, and engaging in software engineering activities related to Level 3 support and Change Request programming. This role ensures the smooth operation of network services, resolves complex technical issues, and contributes to the development and enhancement of software systems in a dynamic IT environment. Mission:Ensure Service Availability and Performance: Provide Level 3 support for escalated technical problems to ensure maximum service availability and performance of computer and telecommunication networks and systems to meet business needs and minimize downtime.Monitor Systems: Continuously monitor computer systems using various tools to identify hardware, software, and environmental issues. Conduct root cause analysis (RCA) when problems are detected.Troubleshoot Problems: Triage and troubleshoot issues within defined areas, following standard operating procedures (SOP). Coordinate with third-party vendors, customer contacts, or other IT teams for comprehensive solutions.Track Issues: Carefully track and document all defects and resolutions in detail, contributing to the NOC's knowledge base and maintaining system health records. Update ticketing systems as necessary.Report Incidents: Escalate complex technical issues that require immediate response or troubleshooting to management following SOP. Collaborate with other IT resources, third parties, or vendors for faster resolutions, obtaining proper approvals. Maintain effective communication channels within and outside the team to keep all stakeholders informed.Collaboration: Collaborate with other IT teams and service providers to resolve complex network issues.Collaborate with software development teams to implement changes, enhancements, and fixes as per Change Requests (CRs).Collaborate with stakeholders to document CR programming outcomes and obtain approvals.Bachelor’s degree in Network Engineering, Software engineering or related.1-3 years of experience as a NOC backend engineer or similar role. Certifications: Relevant certifications such as:CISSP (Certified Information Systems Security Professional)MCIPT (Microsoft Certified IT Professional certification)MCTS (Microsoft Certified Technology Specialist certification)Cisco CertificationCompTIA Network+or software development certifications may be beneficial. Technical Skills:Strong knowledge of networking protocols and technologies.Familiarity with version control systems and software development best practices.Server hardware experience with Cisco UCS, HP, and Dell blade systems.Experience working in a large distribution or manufacturing environmentsNetworking protocols: such as TCP/IP, BGP, OSPF, VLANs, VPNs, and MPLS.Network Monitoring Tools: Such as:  Nagios, Paessler PRTG, Zabbix, SolarWinds, Icinga, WhatsUp Gold, NetFlow, Spiceworks, Zenoss.", "Job category ": "IT, new technologies", "Industries ": "IT, software engineering, Internet", "Employment type ": "Freelance", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western - International", "Experience level ": "5 to 10 years", "Educational level  ": "Bachelor", "Key Skills ": "MICROSOFT", "company-description": "AFRICASHORE is an IT offshoring platform connecting IT experts and freelancers based in Africa to companies in Africa, Europe, USA, Canada and UAE remotely. Our partners, IT services companies and large groups, trust us to find them the best offshore Africa-based IT freelance consultants.Our IT offshoring platform is present in 37 countries in Africa with a database of 230,000+ IT experts and freelancers classified into 303 IT specialties around 9 IT fields: Database Administration and NoSQL - Network and Telecom Security - ERP and Integrated Management Software - Big Data, Data Science and Business Intelligence (BI) - Programming, Development - IT Project Management - Consulting, Audit, Coaching and Training - Digital Marketing, SEO, Design and Multimedia - Production, Operations and Support.Freelancers, work remotely from Africa on IT projects around the world!Companies, outsource with AFRICASHORE your IT teams and projects offshore to Africa!For more information, please visit our website at https://www.africashore.com"},
{"company-title-link": "https://www.ghanajob.com/recruiter/32025", "company-title": "AFRICAWORK", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/logo_africawork_1180x129_2.jpg?itok=3N_y2YFz", "company-website-label": "Website : ", "company-website-url": "https://www.africawork.com", "company-sector": "Industries : ", "company-sector-fields": ["Temporary work, recruitment"], "job-title": "Position : Logistics Manager", "job-description": "We are looking for profiles and CVs of Logistics Managers that we will send to our large account customers for their future recruitment needs.As a Logistics Manager, you will:", "Job category ": "Transport, logistics", "Industries ": "Education, training", "Employment type ": "Permanent contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "2 to 5 years", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "transport", "company-description": "AFRICAWORK is a recruitment service provider specialised in finding the right skills and talents in Africa. Since its creation in 2012, AFRICAWORK supports its clients and partners by helping them find the best resources for their organisations.Present in 37 countries in Africa, AFRICAWORK has experienced teams of HR consultants, recruiting platforms in each country and a large CV library of over 3 million professionals.Our mission is to accompany companies throughout their recruitment projects until their completion, and to make human capital the vector of their growth. Our ability to allocate the right resource to each context allows us to respond quickly and efficiently to their needs.Professionals, candidates, register on our recruitment site to be contacted for a job opportunity or an assignment!For more information, please visit our website at https://www.africawork.com "},
{"company-title-link": "https://www.ghanajob.com/recruiter/114598", "company-title": "BIZ4D", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/image_2021_10_25t09_33_09_564z.png?itok=esnoxSzS", "company-website-label": "Website : ", "company-website-url": "https://www.biz4d.com/", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet", "Marketing, communication, media", "Education, training", "Research and development"], "job-title": "Position : Lead Generation/Marketing Professional", "job-description": "We at Talents2Germany help software engineers from across the globe to migrate to Germany. We need you to get this opportunity in front of the exactly relevant target audience and guide them through the journey of initial decision making until our team of consultants can take over for a personal conversation.Tasks/responsibilities: Skills/strengthsWhat we offer:", "Job category ": "Marketing, communication", "Industries ": "Education, training", "Employment type ": "Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western - International", "Experience level ": "2 to 5 years", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "marketing communication", "company-description": "Here at Biz4d, we share a mutual passion which is driving success through mentoring programs in a digital age. We are a diverse dream team who is passionate to deliver outstanding results. We strive to provide you with an unforgettable learning experience."},
{"company-title-link": "https://www.ghanajob.com/recruiter/126240", "company-title": "M-KOPA", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/m-kopa-isologotype-color-white-back.png?itok=qyUyoopg", "company-website-label": "Website : ", "company-website-url": "https://www.m-kopa.com/", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet", "Banking, insurance, finance", "Services other"], "job-title": "Position : Sales Administrator -Kumasi", "job-description": "The purpose of the job is to provide support and manage sales administrative responsibilities such as; sales commission issues, service issues, meeting organization, logistics, BTL logistics and stores management, communication with non-selling DSRs, promotional SMS to DSRs, cost-effective measures, and reporting management.Roles And ResponsibilitiesSkills RequiredProcess-Oriented Mindset:Experience RequiredEducation Required", "Job category ": "Sales", "Industries ": "Banking, insurance, finance", "Employment type ": "Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "2 to 5 years", "Educational level  ": "Bachelor", "Key Skills ": "sales", "company-description": "M-KOPA is the pioneer and global leader of Connected Asset Financing that offers millions of underbanked customers access to life-enhancing products. Our advanced connected asset financing platform combines digital micropayments and IoT connectivity to offer access to products including solar lighting, televisions, fridges, smartphones, financial services and more. Our mission is to make financing for everyday essentials accessible to customers in Africa and beyond so they can achieve progress in their lives. Through the power of connected devices, we establish a unique and secure relationship with our customers, allowing them instant access to a product whilst building ownership overtime through flexible micro-payments. Through regular payments, customers can unlock access to more products and services to continue their relationship and build their credit history with M-KOPA.   To date, M-KOPA has provided nearly $400 million in financing that has enabled over 1 million customers to access solar lighting, energy-efficient televisions and fridges, smartphones, cash loans, and more."},
{"company-title-link": "https://www.ghanajob.com/recruiter/149128", "company-title": "DELOITTE", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/deloitte-logo.png?itok=MvmT9-TV", "company-website-label": "Website : ", "company-website-url": "https://www.deloitte.com/global.com", "company-sector": "Industries : ", "company-sector-fields": ["Temporary work, recruitment"], "job-title": "Position : Senior Business Tax Consultant", "job-description": "Job DescriptionSuccessful applicants will have the opportunity to collaborate with other Deloitte member Firms and work with several high-profile multinational organisations and develop their leadership capabilities.Responsibilities Qualifications", "Job category ": "Accounting, controlling, finance", "Industries ": "Advice, audit, accounting", "Employment type ": "Permanent contract - Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "2 to 5 years", "Educational level  ": "Master", "Key Skills ": "finance", "company-description": "Deloitte est le moteur du progrès. Nos cabinets du monde entier aident nos clients à devenir des leaders partout où ils choisissent de rivaliser. Deloitte investit dans des personnes exceptionnelles aux talents et aux antécédents divers et leur donne les moyens d'accomplir plus qu'elles ne le pourraient ailleurs. Notre travail allie conseil, action et intégrité. Nous pensons que lorsque nos clients et la société sont plus forts, nous le sommes aussi."},
{"company-title-link": "https://www.ghanajob.com/recruiter/129256", "company-title": "CATHOLIC RELIEF SERVICES", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/catholic-relief-services-logo.jpg?itok=ByPany2X", "company-website-label": "Website : ", "company-website-url": "https://www.crs.org", "company-sector": "Industries : ", "company-sector-fields": ["Associative activities", "Services other", "Social, public and human services"], "job-title": "Position : WARO Regional Risk and Compliance Manager", "job-description": "Job DescriptionAbout CRSCatholic Relief Services is the official international humanitarian agency of the Catholic community in the United States. CRS works to save, protect, and transform lives in need in more than 100 countries, without regard to race, religion or nationality. CRS’ relief and development work is accomplished through programs of emergency response, HIV, health, agriculture, education, microfinance and peacebuilding.Job SummaryYou will manage risk functions for the country program (CP) adhering to CRS policies, local laws, and donor regulations to ensure effective delivery of high-quality programming to the poor and vulnerable. Your knowledge and guidance will reduce risk to staff, to the effectiveness of our programming and to the people we serve through the application of the principles of stewardship, integrity, transparency, and accountability.ResponsibilitiesRoles and Key Responsibilities:Fraud Allegation Management Surge capacity roleQualificationsBasic QualificationsKnowledge, Skills And AbilitiesPreferred QualificationsAgency-wide Competencies (for all CRS Staff) These are rooted in the mission, values, and guiding principles of CRS and used by each staff member to fulfill his or her responsibilities and achieve the desired results.", "Job category ": "Health and social professions", "Industries ": "Associative activities", "Employment type ": "Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "5 to 10 years", "Educational level  ": "Master", "Key Skills ": "education", "company-description": "Catholic Relief Services is the official international humanitarian agency of the Catholic community in the United States. We alleviate suffering and provide assistance to people in need in more than 100 countries, without regard to race, belief or nationality. CRS maintains strict standards of efficiency, accountability and transparency. Last year, more than 92 percent of revenues spent went directly to programs that benefit the poor overseas."},
{"company-title-link": "https://www.ghanajob.com/recruiter/152445", "company-title": "WAKANOW", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/wakanow.jpg?itok=dzXAtvzx", "company-website-label": "Website : ", "company-website-url": "https://www.wakanow.com", "company-sector": "Industries : ", "company-sector-fields": ["Tourism, leisure activities", "Transport, logistics, postal services"], "job-title": "Position : Operations Manager, Anglophone", "job-description": "Job DescriptionJob ObjectiveThe Operations Project Manager in Accra will play a pivotal role in assisting the Contact Centre Manager and the Lagos team in seamlessly integrating global processes and new products into our operations. This role is dedicated to ensuring a cohesive and efficient transition, enhancing our ability to deliver exceptional travel experiences to our customers within the Anglophone market.ResponsibilitiesRequirements", "Job category ": "Management", "Industries ": "Tourism, leisure activities", "Employment type ": "Permanent contract - Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "5 to 10 years", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "management", "company-description": "Wakanow is Africa’s leading travel tech company and the curator of the best travel experiences. We offer travelers the cheapest available fares for flights, hotel reservations, airport pickups, visa assistance, vacation packages and many other travel services from a broad selection of partners. We pride ourselves on providing customers with everything they need to research, plan and conveniently pay for a trip locally and globally."},
{"company-title-link": "https://www.ghanajob.com/recruiter/151259", "company-title": "HENDERSON SCOTT", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/hendersonscott_logo.jpg?itok=p-qdUAR5", "company-website-label": "Website : ", "company-website-url": "https://www.hendersonscott.co.uk/", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet", "Marketing, communication, media"], "job-title": "Position : Senior Full Stack  Engineer  - PYTHON/TYPESCRIPT", "job-description": "We are seeking a senior full stack developer with a passion to build and create innovative, durable, and elegant solutions. You will be involved in the development, management and deployment of the backend cloud infrastructure.Building APIs, dashboards, debugging customer issues, and solving technical and data related problems. You will play a big part in our ongoing success by ensuring our application environments are stable and our clients application deployments are high quality.Essential Duties and Responsibilities:Required Qualifications:Preferred Skills and Experience:", "Job category ": "IT, new technologies", "Industries ": "IT, software engineering, Internet", "Employment type ": "Permanent contract - Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western - International", "Experience level ": "5 to 10 years", "Educational level  ": "Master", "Key Skills ": "FULL STACK", "company-description": "Henderson Scott is an international provider of award-winning talent solutions, delivering outstanding results to clients and candidates in the UK, Europe, US and APAC regions. Henderson Scott specialises in placing Digital, Technology & Commercial professionals globally and is a sister company to Search (www.search.co.uk) a multi-national organisation which deliver to over 20 disciplines. Henderson Scott & Search operate across 20 offices, employing over 1000 staff and with turnover in excess of £200 million therefore the businesses are well established, reputable and highly profitable. Henderson Scott delivers to the following specialist markets: TECHNOLOGY • Software Development • Data & BI • Digital • Test & QA • Architecture • Infrastructure & Support • ERP – SAP, Oracle, Workday, Salesforce, ServiceNow • DevOps & Cloud • Change & Transformation • Cyber & Information Security • Defence & Intelligence COMMERCIAL – Cyber Security, Enterprise Software, Cloud & IT Services • GTM Leadership (CRO – VP) • Account Executives (Enterprise – Mid-market) • Channel & Alliance • Pre-Sales – Solutions Consultants • Solution Architecture • Marketing • Product Marketing • Technology Evangelists / Advocates • Customer Success • Technical Account Management • Professional Services We have built a reputation for our market leading and cost-effective talent solutions, utilising cutting edge resourcing techniques and extensive professional networks to ensure we deliver on even the most challenging of roles. Operating from UK offices, our global partners do not have to compromise on quality, or manage alternative suppliers in order to effectively service all areas of their business. As a multi-award winning organisation, we have been recognised for our services to our clients, dedication to our candidates and commitment to our own internal talent. Recent Recognition: Best Client Service, Recruiter Awards Best Executive Search & Selection Firm Recruitment Company of the Year"},
{"company-title-link": "https://www.ghanajob.com/recruiter/149674", "company-title": "AMAZETHU", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/logo-255.png?itok=tCceSRKq", "company-website-label": "Website : ", "company-website-url": "https://www.amazethu.com", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet"], "job-title": "Position : Intern/Product Design - Full Remote (Africa)", "job-description": "Company DescriptionAmazéthu is a language and technology company. We use the latest in deep learning, speech processing and artificial intelligence technologies to build services that help people access products and services using their voice in any language.Job DescriptionWe're looking to expand our team of designers in Africa. Therefore, we are looking for one Product Design Intern for a four-month contract with the ability to gain a permanent contract.What you will do:QualificationsRequirementsBonus:Additional informationAll your information will be kept confidential according to EEO guidelines.Attach a link to your latest design portfolio in your application", "Job category ": "IT, new technologies", "Industries ": "IT, software engineering, Internet", "Employment type ": "Internship", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "No experience", "Educational level  ": "High school", "Spoken language ": "english›good level", "Key Skills ": "APP", "company-description": "Amazéthu is a language and technology company. We use the latest in deep learning, speech processing and artificial intelligence technologies to build services that help people access products and services using their voice in any language."},
{"company-title-link": "https://www.ghanajob.com/recruiter/152153", "company-title": "HCOWA GHANA LIMITED COMPANY", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/whatsapp_image_2023-11-15_at_3.57.29_pm.jpeg?itok=8I3wrXO2", "company-website-label": "Website : ", "company-website-url": "https://hcowa.com/", "company-sector": "Industries : ", "company-sector-fields": ["Health, pharmacy, hospitals, medical equipment"], "job-title": "Position : Business Development Officer", "job-description": "ResponsibilitiesRequirements", "Job category ": "Marketing, communication", "Industries ": "Health, pharmacy, hospitals, medical equipment", "Employment type ": "Permanent contract", "Region  ": "Greater Accra", "Experience level ": "Less than 2 years", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "marketing communication", "company-description": "A company that seeks to provide necessary and professional healthcare services for West African Nations through leveraging the best healthcare resources across the world."},
{"company-title-link": "https://www.ghanajob.com/recruiter/152150", "company-title": "ARCHTYPE GROUP", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/telechargement_2.png?itok=9bG5-I7z", "company-website-label": "Website : ", "company-website-url": "https://www.archetype-group.com/", "company-sector": "Industries : ", "company-sector-fields": ["Engineering, development studies"], "job-title": "Position : Document Controller", "job-description": "Responsibilities Competencies", "Job category ": "IT, new technologies", "Industries ": "Engineering, development studies", "Employment type ": "Permanent contract - Fixed-term contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "5 to 10 years", "Educational level  ": "College", "Spoken language ": "english›fluent", "Key Skills ": "Pack Office", "company-description": "Archetype Group is a leading international construction consultancy company, we are shaping buildings that last with a full range of consulting services: Architecture & Master Planning, Building Engineering, Industrial & Process Engineering, Project & Cost Management. Since 2002, Archetype Group has been working on over 1,500 projects in 50 different countries across 4 continents in Africa & Middle East - Central & South Asia - East & Southeast Asia - France & Europe - Latin America."},
{"company-title-link": "https://www.ghanajob.com/recruiter/32976", "company-title": "MISSION AFRICA INSTITUTE OF TECHNOLOGY", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/logo_123.jpg?itok=ZEm1WPPQ", "company-website-label": "Website : ", "company-website-url": "http://www.missionafricainc.org", "company-sector": "Industries : ", "company-sector-fields": ["Education, training"], "job-title": "Position : Content Leader/Social Media Marketing Coordinator/Website Designer", "job-description": "We are looking for a Content manager and Media Marketing Coordinator who can design or improve WebsitesResponsibilitiesRequirements ", "Job category ": "IT, new technologies", "Industries ": "Edition, printing", "Employment type ": "Permanent contract", "Region  ": "Greater Accra", "Experience level ": "2 to 5 years", "Educational level  ": "Bachelor", "Spoken language ": "english›native", "Key Skills ": "3D 2D", "company-description": "Mission Africa Institute of Technology is Ghana Education Service Diploma accredited and NIVT Learning Centers. The school was established in 2015 as an ICT, Technical, Business, Media, Music, Building soft Skills, Leadership and Vocational College. We have currently added Business and Management courses, and also a department for Theology. MAIT currently runs a Two year GES Diploma and short couses in Professional Certificate Programmes, Professional Diploma Diploma Programmes, and Advanced Professional Diploma Programmes. Our courses are ran on weekday and weekend basis."},
{"company-title-link": "https://www.ghanajob.com/recruiter/66858", "company-title": "D.S. CONSTRUCTION LIMITED", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/ds_cons_ltd.png?itok=5qPKRtRM", "company-website-label": "Website : ", "company-website-url": "https://www.dscons-gh.com/", "company-sector": "Industries : ", "company-sector-fields": ["Industry, production, manufacturing and other", "Metallurgy, steel industry", "Public buildings and works sector, construction", "Real-estate, architecture, town planning", "Furnishing, decoration"], "job-title": "Position : Security Officer / Guard", "job-description": "We are seeking a dedicated and experienced Security Officer to join our team and play a crucial role in safeguarding our premises, assets, and personnel. The ideal candidate will possess strong observation skills, the ability to maintain composure under pressure, and a commitment to upholding the highest standards of security.Responsibilities:", "Job category ": "Health and social professions", "Industries ": "Cleaning, security, surveillance", "Employment type ": "Permanent contract - Fixed-term contract", "Region  ": "Greater Accra", "Experience level ": "2 to 5 years", "Educational level  ": "High school", "Spoken language ": "english›good level", "Key Skills ": "assistance", "company-description": "D.S Construction Company Limited has been the backbone of many building contractors when it comes to giving aesthetic finishes to buildings for it to meet 21st century standards. It has always been the choice of many well-known licensed architects for years. Our track record over the years in Ghana has won us many contracts from a number of reputable organizations within the country.We deal in the manufacturing and installation of aluminum/glass doors & windows, double glazing, vertical blinds, office furniture, false ceiling, sun breakers, curtain walls, pergolas, balustrades, solar-efficient windows and doors, uPVC doors/windows, alucobond, shower enclosures, aluminum insects nets etc.We are located behind Maxlot Hotel, Opposite Nima Police Station."},
{"company-title-link": "https://www.ghanajob.com/recruiter/139247", "company-title": "AFRICAN TAX ADMINISTRATION FORUM (ATAF)", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/ataf-colour-logo.png?itok=uJpQKMWz", "company-website-label": "Website : ", "company-website-url": "https://www.ataftax.org", "company-sector": "Industries : ", "company-sector-fields": ["Services other"], "job-title": "Position : Long Term Research Expert Development of Data and Analytical System", "job-description": "The African Tax Administration Forum (ATAF) has received financing from the African Development Fund toward the cost of the Regional Institutional Support Project for Public Financial Governance – Phase II (RISPFG) and intends to apply part of the agreed amount for this Grant to payments under the contract for Long-Term Research Expert for Development of Data and Analytical System for Africa.The services included under this project are:The Individual expert is expected to have among others the following qualifications and key competencies:", "Job category ": "Services", "Industries ": "Services other", "Employment type ": "Fixed-term contract", "Region  ": "International", "Experience level ": "5 to 10 years", "Educational level  ": "Master", "Spoken language ": "english›fluent", "Key Skills ": "writing", "company-description": "ATAF strives to build efficient and effective tax administrations in Africa to become the leader on African tax matters, enhance economic development and improve the living standards of the people of Africa.ATAF serves as an African network that aims at improving tax systems in Africa through exchanges, knowledge dissemination, capacity development and active contribution to the regional and global tax agenda.Improved tax systems will increase accountability of the State to its citizen, enhance domestic resource mobilisation and thereby foster inclusive economic growth."},
{"company-title-link": "https://www.ghanajob.com/recruiter/151972", "company-title": "FAE LIMITED", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/0000000000000001_2.png?itok=Yq5wnEP4", "company-website-label": "Website : ", "company-website-url": "https://fae.com.ng/", "company-sector": "Industries : ", "company-sector-fields": ["Industry, production, manufacturing and other"], "job-title": "Position : Mechanical Engineer", "job-description": " RequirementsRequirements", "Job category ": "Production, maintenance, quality", "Industries ": "Industry, production, manufacturing and other", "Employment type ": "Permanent contract", "Region  ": "Central", "Experience level ": "5 to 10 years", "Educational level  ": "Master", "Spoken language ": "english›beginner", "Key Skills ": "processes", "company-description": "FAE LTD is an Envelopes manufacturing company and as such wishes to maintain a work environment that is conducive for staff and visitors. The company also wishes to maintain a work environment that fosters personal and professional growth for all employees. Maintaining such an environment is the responsibility of every staffFAE LIMITED combines basic local knowledge and international expertise to produce a product that is second to none. Our first class equipment ensures that we are able to produce to the specification of our customers and satisfy our ever-growing client base. We earned this right because of the quality, the type of paper we use, and how we serve our clients as a trusted ally and concerned friend.We provide them with the rare loyalty of a business partner and make sure they get what they need timely, and also helping them secure more clients to make more money."},
{"company-title-link": "https://www.ghanajob.com/recruiter/151965", "company-title": "TENDER CARE SCHOOL", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/394962_329510557159655_216245226_n1076433399.jpg?itok=YtmGbCHW", "company-website-label": "Website : ", "company-website-url": "https://tendercareschool.wordpress.com/", "company-sector": "Industries : ", "company-sector-fields": ["Education, training"], "job-title": "Position : French/Spanish Teacher", "job-description": "ResponsibilitiesRequirements", "Job category ": "Health and social professions", "Industries ": "Education, training", "Employment type ": "Permanent contract", "Region  ": "Greater Accra", "Experience level ": "No experience", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "health", "company-description": "We are a Christian-based institution that places strong emphasis on fostering children’s core values and intellectual development."},
{"company-title-link": "https://www.ghanajob.com/recruiter/151323", "company-title": "YEMANUEL STORE", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/img-20231103-wa0001.jpg?itok=RNASFxug", "company-website-label": "Website : ", "company-website-url": "https://yemanuelstore.wixsite.com/store", "company-sector": "Industries : ", "company-sector-fields": ["Marketing, communication, media", "Distribution, selling, wholesale"], "job-title": "Position : Store Manager", "job-description": "We are looking for a professional and customer service-oriented store manager to oversee daily operations at our store.Requirements", "Job category ": "Management", "Industries ": "Advice, audit, accounting", "Employment type ": "Permanent contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "Less than 2 years", "Educational level  ": "Bachelor", "Spoken language ": "english›good level", "Key Skills ": "advertising communication", "company-description": "Shopping made simple. Shop until you drop in our hectic online store! On the Yemanuel Store, shop online for over 1 million quality deals on Fashion and more."},
{"company-title-link": "https://www.ghanajob.com/recruiter/37473", "company-title": "SYLVERSYS", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/svs_logo_2019_horizontal.png?itok=YV9pilCw", "company-website-label": "Website : ", "company-website-url": "https://www.sylversys.com/", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet"], "job-title": "Position : HELPDESK INTERN", "job-description": "The objective of the Helpdesk Intern is to participate in technical assistance for customers. This assistance can take two forms which are remote assistance and on-site assistance. In view of the company's policy relating to the management of the intern, the latter remains a learner who is well integrated into the operations that are carried out.Responsibilities:Qualifications:Educational requirement:Skills-Knowledge-Abilities", "Job category ": "IT, new technologies", "Industries ": "IT, software engineering, Internet", "Employment type ": "Permanent contract", "Region  ": "Greater Accra", "Experience level ": "Less than 2 years", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "ITSM", "company-description": "SYLVERSYS Ghana, a subsidiary of the SYLVERSYS Group, is a Digital Services Company with proven experience in consulting, design, deployment, and support in the field of information technology and the IT services outsourcing industry. Our outsourced services, TechTeam-MSP®, Sentinel-MSS® and AppsTeam- AWS provide talented and ambitious companies with a technology management service, so they can focus exclusively on their core business."},
{"company-title-link": "https://www.ghanajob.com/recruiter/60265", "company-title": "HR RECRUITMENTS", "company-image-url": null, "company-website-label": null, "company-website-url": null, "company-sector": "Industries : ", "company-sector-fields": ["Industry, production, manufacturing and other"], "job-title": "Position : Systems Administrator", "job-description": "Buck Press Ltd in Ofankor is seeking a Systems Administrator to join our IT team. The ideal candidate must be able to provide database administration and support and be a great team player.Job FunctionIn collaboration with the Project Management Team, ensure sustainable and efficient IT capability for the timely provision of information to meet managerial, administrative, and operational needs.Duties and ResponsibilitiesKey Performance IndicatorsQualificationsWork Experience and SkillsInterested candidates should send their CV and Application Letter with the subject, “Systems Administrator” no later than close of day 30th November, 2023.", "Job category ": "IT, new technologies", "Industries ": "Industry, production, manufacturing and other", "Employment type ": "Permanent contract - Fixed-term contract", "Region  ": "Greater Accra", "Experience level ": "Less than 2 years", "Educational level  ": "Bachelor", "Key Skills ": "WAN", "company-description": "HR Recruitments is solely into job advertisements and recruitments for various companies."},
{"company-title-link": "https://www.ghanajob.com/recruiter/150824", "company-title": "VIRTUAL INTELLIGENCE SOLUTIONS", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/vis_logo.png?itok=oWWtqJBJ", "company-website-label": "Website : ", "company-website-url": "https://virtualintel.net/", "company-sector": "Industries : ", "company-sector-fields": ["IT, software engineering, Internet"], "job-title": "Position : Software Developer", "job-description": " Software Specialist Responsibilities:Requirements:", "Job category ": "IT, new technologies", "Industries ": "IT, software engineering, Internet", "Employment type ": "Permanent contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western - International", "Experience level ": "2 to 5 years", "Educational level  ": "Bachelor", "Spoken language ": "english›fluent", "Key Skills ": "PYTHON", "company-description": "Virtual Intelligence Solutions is a full service information communications and technology supplier and services provider privately owned and located in Kingston. We opened our doors in 2019 and since grown to become a very competitive player in the I.T landscape. To that effort, We have continuously sought and have acquired direct dealership of several major technology brands including Dell, Cisco, Microsoft, Acronis, Lenovo and Sophos and started to promote these products in Jamaica."},
{"company-title-link": "https://www.ghanajob.com/recruiter/140371", "company-title": "DESTINY WORK RECRUITMENT", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/destiny_recruitment_.jpg?itok=ELFpdNbQ", "company-website-label": null, "company-website-url": null, "company-sector": "Industries : ", "company-sector-fields": ["Industry, production, manufacturing and other", "Associative activities", "Distribution, selling, wholesale", "Social, public and human services"], "job-title": "Position : Account Clerk", "job-description": "We are looking for a skilled Accounting Clerk to perform a variety of accounting, bookkeeping and financial tasks.Ultimately, a successful candidate will ensure that the company’s daily accounting functions run accurately and effectively.MAIN RESPONSIBILITIES:MAIN REQUIREMENTS/SKILLS", "Job category ": "Accounting, controlling, finance", "Industries ": "Advice, audit, accounting", "Employment type ": "Permanent contract", "Region  ": "Ashanti - Brong Ahafo - Central - Eastern - Greater Accra - Northern - Upper East - Upper West - Volta - Western", "Experience level ": "2 to 5 years", "Educational level  ": "HND", "Spoken language ": "english›fluent", "Key Skills ": "documentation", "company-description": "Destiny Work Recruitment is a professionally managed human resource consultancy, with a focus on recruitment, providing manpower at Senior/Top level to Middle in the different domains over a wide geographical area that spans across Ghana markets. A compelling team of people and dynamic young professionals has formed this organization; the core team brings together a wealth of experience from varied backgrounds."},
{"company-title-link": "https://www.ghanajob.com/recruiter/150734", "company-title": "EDGE PERSONNEL", "company-image-url": "https://www.ghanajob.com/sites/ghanajob.com/files/styles/medium/public/logo/screenshot_2023-06-21_154112.png?itok=ubCWn5uW", "company-website-label": "Website : ", "company-website-url": "https://edgepersonnel.co.za/", "company-sector": "Industries : ", "company-sector-fields": ["Services other"], "job-title": "Position : Commercial Manager", "job-description": "Commercial ManagerLocation: Freetown, Sierra LeoneSalary: $3000 - $3500Responsibilities:Requirements:If you are interested please send your ", "Job category ": "Management", "Industries ": "Import-export business", "Employment type ": "Permanent contract", "Region  ": "Western", "Experience level ": "2 to 5 years", "Educational level  ": "Technical school", "Spoken language ": "english›fluent", "Key Skills ": "leadership", "company-description": "Edge Personnel is a recruitment company that prides themselves on finding the perfect candidate for each individual position."},
[

][

][

][

]